[[{"title": "nice", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 6 June 2023", "body": "Good little product, nice and compact, easy to set up with quality sound."}, {"title": "Great for such small speakers", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 13 May 2023", "body": "Bought these to replace some failing AV40's. I cannot believe how much better these are than those..The sound is quite precise, but a little on the bass side of neutral.(not nearly as much as the AV40 were though), although a small tweak to the high frequency boost pretty much fixes that..The amount of sound these can put out it is impressive for their size and price..Bass is pretty tight (could be deeper but far better than you might expect from a 4.5\" driver), highs are fairly bright and accurate, mids lack a little at the upper end but nothing drastic..I doubt that you'll do better overall without a bigger budget for bigger speakers."}, {"title": "Punch above their weight", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 6 May 2023", "body": "These do need breaking in but once they are, they are great value. Used as nearfield or in the room they produce a great sound for the price. Remember that they are affordable...Connections are limited. I used stereo rca to speaker then 3.5mm other end of the cable to audio device. Lightning adapter needed for apple...A subwoofer out would have been the icing on the cake but not one present here...I don’t hesitate recommending these. I purchased the 4.5."}, {"title": "Brilliant", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 20 April 2023", "body": "Lovely piece of kit"}, {"title": "Cheap!", "rating": "1.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 27 March 2023", "body": "I was looking at the (M-Audio bx8) in interest and noticed in a video on YouTube of a guy unscrewing the woofer for a replacement one and I noticed the front panel is made of some sort of plastic. I have never been interested in speakers with a plastic front as they are prone to vibration, due to the bass from the woofer..I would not bother with these Monitors guys until they change the design from plastic to wood. Save up your cash a little more and buy some quality made monitors without any plastic added to the speaker box."}, {"title": "bass is punchy", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 23 March 2023", "body": "very pleased with these no complaints"}, {"title": "Good quality, good value", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 18 March 2023", "body": "Purchased for home use to play backing tracks and recordings from a small mixer and iPad. Perfect for my needs, good quality and easy to set up."}, {"title": "Had to get my order replaced", "rating": "1.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 15 March 2023", "body": "So I was really excited about getting some new speakers for my pc. These ones look decent enough and I'm sure they are... however... after opening the box and removing the left and right speakers I found nothing else. No power cable, no aux, no connector cables, no foam feet. I'm like... what the heck is going on? Hopefully the replacement I ordered has everything included like the product page, user manual and box itself says it does."}, {"title": "Compact, great sounding monitors", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 5 March 2023", "body": "I bought these to 'replace' the speakers built into the 2020 24in iMac M1, and they certainly add more weight to the bass and clarity to mid and high frequencies. I'd expected a little more, but perhaps that is more testament to the quality of the iMac's integrated audio than a criticism of the BX3BT's. Overall, I'm happy with them."}, {"title": "Reasonable audio quality.", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 4 March 2023", "body": "The first pair I bought had to return due to distortion on the passive channel..Replacement was sent, very good sound quality for a small home studio..Nice bass, mid range, and treble. For the moneythey fit the bill. I am happy with these monitor speakers."}], [{"title": "Good speakers untill it randomly fails with bad ground loop noise", "rating": "2.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 2 March 2023", "body": ""}, {"title": "Brilliant studio monitors", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 28 February 2023", "body": "Great sound, good size. Good value for money would highly recommend"}, {"title": "Ground Loop Isolation Issue", "rating": "1.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 30 January 2023", "body": "Sorry, really cheap quality, sent back. The ground loop hum was horrendous. The cables supplied were terrible too."}, {"title": "Bluetooth Studio Monitors", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 14 January 2023", "body": "awesome speakers connected to Ipad, Iphone, laptop and PC no issues, also for those using linux these also work with debian 11 via bluetooth"}, {"title": "Speakers", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 31 December 2022", "body": "Got for karaoke, sound seams OK."}, {"title": "Good Speakers", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 25 December 2022", "body": "I had to buy cables to connect these as I wanted. It comes with adequate cables but not suited to my synth and the gap between the speakers. Having connected them, they sound very good. I already have M-Audio A40 speakers which are very good. These follow that path. Good value. Good sound."}, {"title": "Absolutely disappointed with this! ys \"120 W\"!!!However, it sounds it is bearly 5-10 W!", "rating": "1.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 17 December 2022", "body": "Absolutely disappointed with this! On the product description it says \"120 W\"!!!! That is the reason I purchased this. However, it sounds it is bearly 5-10 W! If anyone is looking for a good quality sound system, please do not buy this! Total waste of money."}, {"title": "They distort very easy to say there 120 watt", "rating": "2.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 6 December 2022", "body": "They distort very easy to say there 120 watt"}, {"title": "Excelent for video editing", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 3 December 2022", "body": "Great for video edit, the flat sound, real sound. in some cases you must equalize treeble and bass. Don't put speaker near of the Wall."}, {"title": "Really Nice Speakers", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 2 December 2022", "body": "Got these to hook up to my office pc...Really happy with the sound quality, and they didn't break the bank either...Would recommend."}], [{"title": "Super sound quality and perfect size", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 26 November 2022", "body": "Great product and super sound quality. Perfect for a budget home studio set up. Bluetooth connectivity works seamlessly. Connected to my MacBook pro 2019 via the Arturia minifuse to audio interface and no any issues. Really happy with the purchase."}, {"title": "LOVELY SOUND", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 23 October 2022", "body": "I LIKE THE SIZE AND IMPACT, EASY TO INSTALL"}, {"title": "Great budget speakers", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 29 September 2022", "body": "Bought as an upgrade for my existing speaker (an old iphone one) that I was using for my turntable. These are an easy set up, provide a lot more volume,and a decent bit of bass. I'm not a purist or audiophile,so I'm sure there are better speakers out there..but for occasional playing of my old rock albums they're great!.I've got other M-Audio speakers..and they're all good quality and great value for money."}, {"title": "Good for the money", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 25 September 2022", "body": "Sound ok once you get the eq right..Distort on deep bass but good enough to monitor if not using high volume..Pleased overall and do the job."}, {"title": "Offered Alternative Speakers M-audio BX3bt", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 21 September 2022", "body": "I ordered the M-audio BX4 speakers and got an e-mail to say they are being dispatched.Unfortunately they had run out of BX4 Speakers. I was offered the BX3bt which we haggled at the same price and it was agreed and they were sent. I am happy with my speakers they handle my bass/6 string Double neck just how I wanted. Happy Amazon Shopper."}, {"title": "Amazing sound quality value for money", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 30 August 2022", "body": "Value for money"}, {"title": "Great, amazing value for money!", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 16 August 2022", "body": "Absolutely amazing value for money!"}, {"title": "A good paitr of PC speakers", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 15 August 2022", "body": "They arrived yesterday and I connected them to my synth and they have excellent sound reproduction. The speakers feel very robust and could take a fair amount of punishment. An excellent bargain with 15% off currently."}, {"title": "Oomph", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 11 August 2022", "body": "These speakers are excellent. The sound is fantastic. Really great value in my opinion. Would certainly recommend them, whether for music production or just for listening to your music collection."}, {"title": "Good small monitors", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 6 August 2022", "body": "Good luttle monitors for home studio work, pack a lot of punch for their size. Got mine hooked up to a Tascam DP32 g it all works fine."}], [{"title": "Excellent speakers.", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 6 August 2022", "body": "After a long search for pc speakers. I have found Them. Excellent sound and setup. Great volume control. Not run in yet. But sound great. Any one LOOKING FOR PC Speakers. Look No further. Just buy these.Great. Value."}, {"title": "Great intro set of monitors", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 22 July 2022", "body": "I use mine for taking in a rucksack along with a laptop and headphones for DJing at parties..They are small and portable-ish..Sound quality is mint, and they serve as very good desktop speakers when not being taken elsewhere"}, {"title": "Reasonable for the price", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 20 July 2022", "body": "Just using this for my TV. Box was pierced in transport and One of the tweeters has been dented in which is pretty crap!.Probably got sold a pair that had been returned..But any serious producer would never use m-audio budget range. So they are what they are.. Buy KRK if you are serious!"}, {"title": "Good value for your money", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 19 July 2022", "body": "Nothing to dislike about these speakers ,Thay sound really really good for something so small and compact size And the Bass is something else,"}, {"title": "Good but not pure studio monitors.", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 17 July 2022", "body": "These are excellent for all round general use but are not true reference studio monitors. The fact that they’re all rounders means they’re not studio specifics. Bluetooth?! Volume from headphone port is poor however (initially with 80ohm headphones which need more power for driving than the port can deliver but also with 32ohms did not get any decent volume either). Bought them as I was pressed for space but retuned and got BX5 instead after a bit of studio reorganising which are better for studio useage."}, {"title": "Pretty darn good...", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 16 July 2022", "body": "Got these as new computer set up had lousy sound. OMG - love these speakers - I feel like I'm a teenager all over again. Sound is more than good enough for my needs - seems smooth and good definition. Worth the money in my opinion."}, {"title": "way too bassy", "rating": "1.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 14 July 2022", "body": "terrible bassy and at volume they sound atrocious plus these looked like a return no software in package"}, {"title": "Just ok computer/gaming speakers", "rating": "3.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 11 July 2022", "body": "I personally would not use these in a music studio environment or for that use. The sound is ok for watching content and gaming..The bass is boxy and a bit boomy, I have it turned down to allow the mid range frequencies to be heard. The high end is a little lacklustre too. For the money they are JUST ok IMO..PS I listen to music on 2 sets of big apple homepods that sound really good (with the bass turned down!) and owned a pair of Mackie Hr824's."}, {"title": "Brilliant sound", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 8 July 2022", "body": "I use these studio speakers to listen to music at home. Fantastic sound"}, {"title": "Amazing", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 2 July 2022", "body": "Perfect for a room, thumbs up, make sure you get 2x cable jacks if you're using interface."}], [{"title": "The bx3 studio monitors.", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 21 June 2022", "body": "For such small monitors the sound quality is very good. Work well for playback and for trying effects. Definitely a good buy for a small studio."}, {"title": "Brilliant sound for the size.", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 18 June 2022", "body": "I love these monitors. Connected them to a pc. The sound quality is amazing."}, {"title": "Great sound", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 13 June 2022", "body": "Good little speakers with a great bass response. Weirdly, they take a little time to 'wake up' to an audio input signal if nothing has played through them for a while. Must be some kind of energy saving feature..Still great though."}, {"title": "Contestant hissing when plugged into the pc", "rating": "2.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 9 June 2022", "body": "If this hissing wasn't there these would be excellent. The RCA cable, when plugged in. I also can't play via audio interface and pc at the same time."}, {"title": "Great studio speakers", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 10 May 2022", "body": "Very well made speakers with good length cables. Very easy to setup. Love the sound, good bass & very powerful. Using them on pc to do synth work in FL20. Cannot fault them"}, {"title": "Noisy piece of equipment", "rating": "1.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 2 May 2022", "body": "Bought these monitors and at first it was lovely then it starting making whistling noise I sent a lot on cables but nothing seem to work until today it stop work all together waste of money waste of time and been annoyed doing a mix"}, {"title": "If you want a multi purpose speaker these are hard to beat", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 23 April 2022", "body": "I bought these for my home studio setup, being new to music production I was not sure what to expect..I tried them with a variety of sound source, tv, phone and laptop and was impressed with their clarity across the range, clear top, middle and bottom..They are not entertainment speakers so don't boost the bass, the ranges can be boosted via a equaliser otherwise the sound is fairly neutral..Depending on where you live, 120w can be loud enough to annoy your neighbours while I have not found any deterioration in sound quality at higher volumes..Whatever you use these speakers for, they are fantastic value for money and would definitely purchase again."}, {"title": "Incredibly powerful full range sound - perfect for gaming /studio", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 19 April 2022", "body": "I was worried these wouldn’t be the most powerful speakers but I was so wrong!!..Super powerful - full range 10/10..Highly recommend"}, {"title": "Good sound", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 13 April 2022", "body": "Adequate bass response. Good sound. Multimedia/studio design"}, {"title": "BX3", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 9 April 2022", "body": "I purchased these speakers for use with my laptop. I like the size due to the size of the desk I use. The sound quality is certainly not bad for the price but maybe a little bassy for the size but is easily worked around depending on what you want to use them for. You have a choice of connections although personally I use balanced leads in association with an audio interface (Scarlett Solo 3rd gen) that I also highly recommend..All in all very happy with build and sound quality for the price you pay."}], [{"title": "amazing sound", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 5 April 2022", "body": "theses little buggers don't half punch out the lows and highs with sound and are well capable of pushing 70watts with no effort at all"}, {"title": "Crap", "rating": "1.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 30 March 2022", "body": "Crap monitors never 120 watts more like 10 watts"}, {"title": "M-Audio BX3 120W", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 19 March 2022", "body": "Studio Monitors. They are perfect for a small and modest Home Studio for music production. I choose them because of their dimensions - they are small..But they are very good quality per price. I use them to check how my music will sound in speakers. I still mainly use Studio Headphones..They have a flat answer in frequency. They are perfect for what they are made. If you buy them and complain could be because you didn't have done your homework..Yes, they do not have 'deep bass '. Because they are for a different purpose and they are small. The lowest frequency they can play is around of 70 Hertz. For 'booming' bass you may want a 20 Hertz which those small speakers can not fizicaly afford..Still, when I listen to others people music, I use a special beautiful piece of Open Source software to control the sounds: 'easyeffects' for pipewire; I don't use Pulse Audio (I replaced with pipewire)..I want to mention that I use mainly Linux (Manjaro) and Open Source software."}, {"title": "Sound quality not good", "rating": "1.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 18 March 2022", "body": "It claims the speaker can be used as a desktop computer speaker, but the sound quality is worse than my Macbook Pro 16 2021. And if I plugged AUX input, it will override the sound of the main input, while the other P brand similar price range monitor speaker can mix two sounds together, that a good feature for me. Therefore, I returned it, and get the P brand speaker that sound is much better than this in my case."}, {"title": "Auxilliary Function", "rating": "3.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 4 March 2022", "body": "Auxilliary function was used. The volume would not turn right down. The control appears not to be gradual (logarithmic), but I did not turn it up much as the volume at NIL was easy listening volume anyway. I was sorry to send these back, as the sound quality was very good, but had no choice as the volume control was just not for me."}, {"title": "Great lil speakers", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 1 March 2022", "body": "Nice bass and a good top end"}, {"title": "Perfect for what we wanted them for", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 27 February 2022", "body": "The tiny wire connecting the speakers especially the length"}, {"title": "Best you can get for the price", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 10 February 2022", "body": "Nothing bad to say. For this money you get a great range of sounds. Perfect for my home studio production"}, {"title": "M-AUDIO BX4 Active speakers.", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 17 January 2022", "body": "A fun and amazing speaker system! If you are looking for rich tonal sounding speakers you've got it with these awesome looking cuties. Way down deep rich bass which won't disappoint and will get the attention of your neighbours. Amazing when you consider these are only active speakers. I fully endorse M-AUDIO BX4 120 watt speaker system!..Footnote - A message to Amazon please continue to stay awake and not send me anymore wrong orders and I promise to always love you xxx :-)"}, {"title": "Great quality sound, with one gripe.", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 16 January 2022", "body": "Bought these as my last pair went bang. Was impressed with the sound, very good. My only gripe is that if they haven't been used for a while, the sound takes time to come out of them, what I mean is if I put sound through them, it takes a few seconds for the sound to come out, strange I know? Apart from that though, all good."}], [{"title": "Not what is advertised (revised)", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 13 January 2022", "body": "Ok M-Audio originally i gave you two stars for advertising pro tools when in fact it had been discontinued. You have now changed this to what it should be and I can give you a new review... The speakers are really good .. A great sound which I have hooked up to my tascam 32 track recorder. They are a nice volume with plenty of inputs at the rear. They are also well made. I can even use them as a small Pa system in my room. Great price too.... So now i will give you 5 stars :)"}, {"title": "Not that good", "rating": "2.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 6 January 2022", "body": "Wasn't 120 watts wasn't enough volume before distorting a shame really"}, {"title": "Quite good for value, not bad sound can work with it", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 1 January 2022", "body": "As spare monitor for mixing"}, {"title": "Great Studio Monitors for the price!", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 30 December 2021", "body": "Due to a failure of one of my Adam A3x monitors I use, I wanted to get a temporary pair of monitors for my small studio/work from home setup. I am incredibly impressed with the overall sound and build quality of these speakers for sub £100. I like the fact that you can control the EQ of the speakers to match the room - I have very small ‘box’ room that I use and I’m limited to size of the equipment. Easy setup. I would say that there is a slight lack of the midrange frequencies, but nothing too substantial - I’m being very picky here. Very happy with the purchase."}, {"title": "Quality", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 11 December 2021", "body": "I am quiet happy for my purchase.It’s very good sounds when connected to focusrite enterface to computer. Thank you for the people who had helped me for the connection. Cable are supplied. Why I got 4 star because instructions only showed phone and tablet only for the setting up…but otherwise very good quality .."}, {"title": "Great speakers but no cables", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 8 November 2021", "body": "I bought these speakers after great reviews .. Opened the box and there they were. Good looking speakers. Realised the cables were not inside the box despite the product description saying that inside the box it included the speakers and cables. I had to go and buy what I needed to plug them in costing a further £28.00.. I was not happy so total cost for the BX4 came to £128 total... M-Audio... Sort this out please for the next unsuspecting customer.. Shame because its a great product!"}, {"title": "Average sound at best", "rating": "3.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 29 September 2021", "body": "Sound quality it at best average."}, {"title": "Great things come in little packages", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 5 March 2021", "body": "Pleasantly priced, incredible sound quality and depth, unbelievable unfaltering volume from such a small set of monitors..Absolute quality and a complete steal."}, {"title": "Nice powerfull speakers", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 1 March 2021", "body": "Does the job"}, {"title": "M-Audio BX3", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 23 February 2021", "body": "Absolutely spot on quality for the price"}], [{"title": "Fab speakers for the price", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 2 February 2021", "body": "These are my first monitor speakers and I'm pleased with them"}, {"title": "Sound-Very Good", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 31 January 2021", "body": "Using these monitors with PreSonus Studio One-5 and PreSonus Studio 24c Audio Interface and onboard dell sound card. Sound quality is good, loud and clear, but can't compare with any other Monitors as my old set up was a small Altec Lancing desk top speakers and sub- woofer which I had for years."}, {"title": "Amazing monitors!", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 28 January 2021", "body": "I really like the sound on these guys. Not at all very bassy as other reviews had claimed it to be but then again sound can be a matter of taste and perception...For me its very well balanced, good mids and treble with just the right amount of bass. Good sound definition...For this price its probably the best home studio monitors I've ever had and dont think I will be swapping them for anything else anytime soon...Really worth it!"}, {"title": "Distorted bass", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 12 January 2021", "body": "The speakers would have been perfect but the let down was the bass,after the first day it went all distorted and I have no idea why.sometimes it's OK and sometimes not.everytime I send stuff back I'm paying over £25 p&p.so I give up....."}, {"title": "M-Audio BX 4 worth every penny.", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 11 January 2021", "body": "For the money these sound great and look the part, resembling their bigger/older sibling the BX 5. Bass response exceeded my expectations, both high and low eq can be adjusted around the back..I've had these for 2 weeks now and can say I am really pleased and would recommend. My only gripe is (and this could be a deal breaker for some) the sound quality from the headphone socket is awful, with a significant amount of bottom end missing when compared to my audio interface headphone out. I also replaced the cheap speaker connecting cable as it is really thin and longer than I need..UPDATE: I tried the headphone socket again and it seems fine now, maybe I hadn't plugged it in all the way before."}, {"title": "DJ approval!!", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 11 January 2021", "body": "Sound quality and size of speakers perfect for good quality home entertainment and more!!.Purchased for an experienced DJ and they are extremely pleased with performance."}, {"title": "Very Precise", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 8 January 2021", "body": "Superb all round"}, {"title": "Excellent Monitor Speakers - Great volume, bass and build quality (Slight sound colouration though)", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 7 January 2021", "body": "Great Monitors for PC or record player / sound system. Very well made and look and sound fantastic. Very powerful (120W) for the size and very impressed with the bass response. Versatile with great input and sound adjustments. Very solid units. The Left/Right switch is brilliant as you can assign the speaker depending on your socket and cable positions...However, I also have a set of Presonus Eris E 4.5 monitors and I have to say that the Eris Monitors are not as powerful but I believe the sound quality is a little better. By that I mean that you get a truer/honest/ more neutral sound. The difference isn't huge but is noticeable. So if music production is your game then I would recommend the E4.5s over the M- Audio BX-4s. I have given the M-Audio 5 stars and it 100% suits my needs as speakers for my record player. The sound colouration difference between the two is not huge and the M-Audio are by far the best you will get for £100. They look and operate like much more expensive units...If you want a really full sound, great bass, versatility and build quality, I don't think you'll do better than the M- Audio at this price point. If you are mixing, recording or producing however and want a true and uncoloured sound and you don't need endless volume, then the 2x25 Watt Eris 4.5 are by far the most superior monitors out there for under £150."}, {"title": "Excellent", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 31 December 2020", "body": "Excellent for the money"}, {"title": "Worth the cost", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 23 December 2020", "body": "Unbelievably beautiful sound. Didn't expect it to be this good. If you are sick of trying new speakers, this would be the last one that you'd purchase."}], [{"title": "Why are you reading reviews? just buy them, they are mental 😁", "rating": "5.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 14 December 2020", "body": "Fantastic sound and build quality, perfect for bedroom audio production. I use these with my tablet and a usb audio interface for Guitar effects and recording. They have exceeded my expectations. Clean, accurate and powerful sound repreduction for such small speakers. No electrical hum that i can detect..These also look awsome with the woven cones, and maybe one of the most satisfying volume dials i have ever used... such a nice click turning them on, almost worth it for that alone lol 😂👍.Pretty sure u cant beat these for the price"}, {"title": "Great Speakers for basic needs!", "rating": "4.0 out of 5 stars", "place and date": "Reviewed in the United Kingdom 🇬🇧 on 27 November 2020", "body": "Very happy with my purchase! A nice loud, clean and rounded sound for a good price :-).BUT you should know the following:.*The speakers emit a hum when turned up past quite a low level - But luckily, they're already loud for my needs.*A hopelessly crackly cable is provided to connect the passive speaker, you'll need to replace it!.* The +6db/-6db for bass/treble feature is great, but sounds more like +4db/-4db to me. I've set mine on max..*They're good for making/listening to music/watching Netflix etc, NOT serious reference monitors!"}], [], [], [], [], [], [], [], [], [], []]